# Operations

In [1]:
import numpy as np
import pandas as pd

In [2]:
test_data = np.random.randint(0,9, size = (5,5))
test_data

array([[7, 7, 2, 4, 8],
       [0, 4, 0, 1, 5],
       [3, 2, 6, 5, 7],
       [0, 2, 0, 3, 3],
       [2, 1, 2, 5, 5]])

In [3]:
data_frame = pd.DataFrame(test_data, index = "R1 R2 R3 R4 R5".split(), columns = "C1 C2 C3 C4 C5".split())
data_frame

    C1  C2  C3  C4  C5
R1   7   7   2   4   8
R2   0   4   0   1   5
R3   3   2   6   5   7
R4   0   2   0   3   3
R5   2   1   2   5   5

In [5]:
data_frame["C6"] = ["Hex", "N", "Bit", "AI", "ML"]
data_frame

    C1  C2  C3  C4  C5   C6
R1   7   7   2   4   8  Hex
R2   0   4   0   1   5    N
R3   3   2   6   5   7  Bit
R4   0   2   0   3   3   AI
R5   2   1   2   5   5   ML

In [6]:
#prints n number of rows
print(data_frame.head(2))

    C1  C2  C3  C4  C5   C6
R1   7   7   2   4   8  Hex
R2   0   4   0   1   5    N

In [9]:
# prints the number of unique values
print(data_frame["C4"].nunique())

4

In [11]:
#prints the unique numbers 
print(data_frame["C4"].unique())

[4 1 5 3]

In [12]:
print(len(data_frame["C4"].unique()))

4

In [14]:
#prints the repetition count of each number
c

5    2
1    1
3    1
4    1
Name: C4, dtype: int64

## User defined functions on pandas data

In [15]:
print(data_frame["C4"].mean())

3.6

In [16]:
def multiply_ten(var):
    return var*10

In [17]:
print(data_frame["C4"].apply(multiply_ten))

R1    40
R2    10
R3    50
R4    30
R5    50
Name: C4, dtype: int64

In [18]:
# checking length of each string element  in C6
print(data_frame["C6"].apply(len))

R1    3
R2    1
R3    3
R4    2
R5    2
Name: C6, dtype: int64

In [20]:
# data_frame.sort_values("C6")
data_frame.sort_values("C6", ascending = False)

    C1  C2  C3  C4  C5   C6
R2   0   4   0   1   5    N
R5   2   1   2   5   5   ML
R1   7   7   2   4   8  Hex
R3   3   2   6   5   7  Bit
R4   0   2   0   3   3   AI

In [22]:
data_frame.drop("C6", axis = 1).sort_values(by = "R2", axis = 1)

    C1  C3  C4  C2  C5
R1   7   2   4   7   8
R2   0   0   1   4   5
R3   3   6   5   2   7
R4   0   0   3   2   3
R5   2   2   5   1   5

In [25]:
data_frame.isnull()

       C1     C2     C3     C4     C5     C6
R1  False  False  False  False  False  False
R2  False  False  False  False  False  False
R3  False  False  False  False  False  False
R4  False  False  False  False  False  False
R5  False  False  False  False  False  False